---
kind: other
id: Methods.T:Autodesk.Revit.DB.HasValueFilterRule
source: html/bc9b11e7-ecc6-bf90-9159-6112e2637926.htm
---
# HasValueFilterRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.